# Map of different fonts styles
    
FONTS = {
  "nn": ('0', '1', '2' ,'3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'),
  "fb": ('𝟎', '𝟏', '𝟐', '𝟑', '𝟒', '𝟓', '𝟔', '𝟕', '𝟖', '𝟗', '𝐀', '𝐁', '𝐂', '𝐃', '𝐄', '𝐅', '𝐆', '𝐇', '𝐈', '𝐉', '𝐊', '𝐋', '𝐌', '𝐍', '𝐎', '𝐏','𝐐', '𝐑', '𝐒', '𝐓', '𝐔', '𝐕', '𝐖', '𝐗', '𝐘', '𝐙', '𝐚', '𝐛', '𝐜', '𝐝', '𝐞', '𝐟', '𝐠', '𝐡', '𝐢', '𝐣', '𝐤', '𝐥', '𝐦', '𝐧', '𝐨', '𝐩', '𝐪', '𝐫', '𝐬', '𝐭', '𝐮', '𝐯', '𝐰', '𝐱', '𝐲', '𝐳'),
  "fi": ('𝟶', '𝟷', '𝟸', '𝟹', '𝟺', '𝟻', '𝟼', '𝟽', '𝟾', '𝟿', '𝐴', '𝐵', '𝐶', '𝐷', '𝐸', '𝐹', '𝐺', '𝐻', '𝐼', '𝐽', '𝐾', '𝐿', '𝑀', '𝑁', '𝑂', '𝑃', '𝑄', '𝑅', '𝑆', '𝑇', '𝑈', '𝑉', '𝑊', '𝑋', '𝑌', '𝑍', '𝑎', '𝑏', '𝑐', '𝑑', '𝑒', '𝑓', '𝑔', 'ℎ', '𝑖', '𝑗', '𝑘', '𝑙', '𝑚', '𝑛', '𝑜', '𝑝', '𝑞', '𝑟', '𝑠', '𝑡', '𝑢', '𝑣', '𝑤', '𝑥', '𝑦', '𝑧'),
  "fd": ('𝟎', '𝟏', '𝟐', '𝟑', '𝟒', '𝟓', '𝟔', '𝟕', '𝟖', '𝟗', '𝑨', '𝑩', '𝑪', '𝑫', '𝑬', '𝑭', '𝑮', '𝑯', '𝑰', '𝑱', '𝑲', '𝑳', '𝑴', '𝑵', '𝑶', '𝑷', '𝑸', '𝑹', '𝑺', '𝑻', '𝑼', '𝑽', '𝑾', '𝑿', '𝒀', '𝒁', '𝒂', '𝒃', '𝒄', '𝒅', '𝒆', '𝒇', '𝒈', '𝒉', '𝒊', '𝒋', '𝒌', '𝒍', '𝒎', '𝒏', '𝒐', '𝒑', '𝒒', '𝒓', '𝒔', '𝒕', '𝒖', '𝒗', '𝒘', '𝒙', '𝒚', '𝒛'),
  "tn": ('𝟶', '𝟷', '𝟸', '𝟹', '𝟺', '𝟻', '𝟼', '𝟽', '𝟾', '𝟿', '𝒜', '𝐵', '𝒞', '𝒟', '𝐸', '𝐹', '𝒢', '𝐻', '𝐼', '𝒥', '𝒦', '𝐿', '𝑀', '𝒩', '𝒪', '𝒫', '𝒬', '𝑅', '𝒮', '𝒯','𝒰', '𝒱', '𝒲', '𝒳', '𝒴', '𝒵', '𝒶', '𝒷', '𝒸', '𝒹', '𝑒', '𝒻', '𝑔', '𝒽', '𝒾', '𝒿', '𝓀', '𝓁', '𝓂', '𝓃', '𝑜', '𝓅', '𝓆', '𝓇', '𝓈', '𝓉', '𝓊', '𝓋', '𝓌', '𝓍', '𝓎', '𝓏'),
  "tb": ('𝟎', '𝟏', '𝟐', '𝟑', '𝟒', '𝟓', '𝟔', '𝟕', '𝟖', '𝟗', '𝓐', '𝓑', '𝓒', '𝓓', '𝓔', '𝓕', '𝓖', '𝓗', '𝓘', '𝓙', '𝓚', '𝓛', '𝓜', '𝓝', '𝓞', '𝓟', '𝓠', '𝓡', '𝓢', '𝓣', '𝓤', '𝓥', '𝓦', '𝓧', '𝓨', '𝓩', '𝓪', '𝓫', '𝓬', '𝓭', '𝓮', '𝓯', '𝓰', '𝓱', '𝓲', '𝓳', '𝓴', '𝓵', '𝓶', '𝓷', '𝓸', '𝓹', '𝓺', '𝓻', '𝓼', '𝓽', '𝓾', '𝓿', '𝔀', '𝔁', '𝔂', '𝔃'),
  "gn": ('𝟶', '𝟷', '𝟸', '𝟹', '𝟺', '𝟻', '𝟼', '𝟽', '𝟾', '𝟿', '𝔄', '𝔅', 'ℭ', '𝔇', '𝔈', '𝔉', '𝔊', 'ℌ', 'ℑ', '𝔍', '𝔎', '𝔏', '𝔐', '𝔑', '𝔒', '𝔓', '𝔔', 'ℜ', '𝔖', '𝔗', '𝔘', '𝔙', '𝔚','𝔛', '𝔜', 'ℨ', '𝔞', '𝔟', '𝔠', '𝔡', '𝔢', '𝔣', '𝔤', '𝔥', '𝔦', '𝔧', '𝔨', '𝔩', '𝔪', '𝔫', '𝔬', '𝔭', '𝔮', '𝔯', '𝔰', '𝔱', '𝔲', '𝔳', '𝔴', '𝔵', '𝔶', '𝔷'),
  "gb": ('𝟎', '𝟏', '𝟐', '𝟑', '𝟒', '𝟓', '𝟔', '𝟕', '𝟖', '𝟗', '𝕬', '𝕭', '𝕮', '𝕯', '𝕰', '𝕱', '𝕲', '𝕳', '𝕴', '𝕵', '𝕶', '𝕷', '𝕸', '𝕹', '𝕺', '𝕻', '𝕼', '𝕽', '𝕾', '𝕿', '𝖀','𝖁', '𝖂', '𝖃', '𝖄', '𝖅', '𝖆', '𝖇', '𝖈', '𝖉', '𝖊', '𝖋', '𝖌', '𝖍', '𝖎', '𝖏', '𝖐', '𝖑', '𝖒', '𝖓', '𝖔', '𝖕', '𝖖', '𝖗', '𝖘', '𝖙', '𝖚', '𝖛', '𝖜', '𝖝', '𝖞', '𝖟'),
  "hn": ('𝟘', '𝟙', '𝟚', '𝟛', '𝟜', '𝟝', '𝟞', '𝟟', '𝟠', '𝟡', '𝔸', '𝔹', 'ℂ', '𝔻', '𝔼', '𝔽', '𝔾', 'ℍ', '𝕀', '𝕁', '𝕂', '𝕃', '𝕄', 'ℕ', '𝕆', 'ℙ', 'ℚ', 'ℝ', '𝕊', '𝕋', '𝕌', '𝕍', '𝕎', '𝕏', '𝕐', 'ℤ', '𝕒', '𝕓', '𝕔', '𝕕', '𝕖', '𝕗', '𝕘', '𝕙', '𝕚', '𝕛', '𝕜', '𝕝', '𝕞', '𝕟', '𝕠', '𝕡', '𝕢', '𝕣', '𝕤', '𝕥','𝕦', '𝕧', '𝕨', '𝕩', '𝕪', '𝕫'),
  "sn": ('𝟢', '𝟣', '𝟤', '𝟥', '𝟦', '𝟧', '𝟨', '𝟩', '𝟪', '𝟫', '𝖠', '𝖡', '𝖢', '𝖣', '𝖤', '𝖥', '𝖦', '𝖧', '𝖨', '𝖩', '𝖪', '𝖫', '𝖬', '𝖭', '𝖮', '𝖯', '𝖰', '𝖱', '𝖲', '𝖳', '𝖴', '𝖵', '𝖶', '𝖷', '𝖸', '𝖹', '𝖺', '𝖻', '𝖼', '𝖽', '𝖾', '𝖿', '𝗀', '𝗁', '𝗂', '𝗃', '𝗄', '𝗅', '𝗆', '𝗇', '𝗈', '𝗉', '𝗊', '𝗋', '𝗌', '𝗍', '𝗎', '𝗏', '𝗐', '𝗑', '𝗒', '𝗓'),
  "si": ('𝟢', '𝟣', '𝟤', '𝟥', '𝟦', '𝟧', '𝟨', '𝟩', '𝟪', '𝟫', '𝘈', '𝘉', '𝘊', '𝘋', '𝘌', '𝘍', '𝘎', '𝘏', '𝘐', '𝘑', '𝘒', '𝘓', '𝘔', '𝘕', '𝘖', '𝘗', '𝘘', '𝘙', '𝘚', '𝘛', '𝘜', '𝘝', '𝘞', '𝘟', '𝘠', '𝘡', '𝘢', '𝘣', '𝘤', '𝘥', '𝘦', '𝘧', '𝘨', '𝘩', '𝘪', '𝘫', '𝘬', '𝘭', '𝘮', '𝘯', '𝘰', '𝘱', '𝘲', '𝘳', '𝘴', '𝘵', '𝘶', '𝘷', '𝘸', '𝘹', '𝘺', '𝘻'),
  "sb": ('𝟬', '𝟭', '𝟮', '𝟯', '𝟰', '𝟱', '𝟲', '𝟳', '𝟴', '𝟵', '𝗔', '𝗕', '𝗖', '𝗗', '𝗘', '𝗙', '𝗚', '𝗛', '𝗜', '𝗝', '𝗞', '𝗟', '𝗠', '𝗡', '𝗢', '𝗣', '𝗤', '𝗥', '𝗦', '𝗧', '𝗨', '𝗩', '𝗪', '𝗫', '𝗬', '𝗭', '𝗮', '𝗯', '𝗰', '𝗱', '𝗲', '𝗳', '𝗴', '𝗵', '𝗶', '𝗷', '𝗸', '𝗹', '𝗺', '𝗻', '𝗼', '𝗽', '𝗾', '𝗿', '𝘀', '𝘁', '𝘂', '𝘃', '𝘄', '𝘅', '𝘆', '𝘇'),
  "sd": ('𝟬', '𝟭', '𝟮', '𝟯', '𝟰', '𝟱', '𝟲', '𝟳', '𝟴', '𝟵', '𝘼', '𝘽', '𝘾', '𝘿', '𝙀', '𝙁', '𝙂', '𝙃', '𝙄', '𝙅', '𝙆', '𝙇', '𝙈', '𝙉', '𝙊', '𝙋', '𝙌', '𝙍', '𝙎', '𝙏', '𝙐', '𝙑', '𝙒', '𝙓', '𝙔', '𝙕', '𝙖', '𝙗', '𝙘', '𝙙', '𝙚', '𝙛', '𝙜', '𝙝', '𝙞', '𝙟', '𝙠', '𝙡', '𝙢', '𝙣', '𝙤', '𝙥', '𝙦', '𝙧', '𝒔', '𝙩', '𝙪', '𝙫', '𝙬', '𝙭', '𝙮', '𝙯'),
  "wn": ('𝟶', '𝟷', '𝟸', '𝟹', '𝟺', '𝟻', '𝟼', '𝟽', '𝟾', '𝟿', '𝙰', '𝙱', '𝙲', '𝙳', '𝙴', '𝙵', '𝙶', '𝙷', '𝙸', '𝙹', '𝙺', '𝙻', '𝙼', '𝙽', '𝙾', '𝙿', '𝚀', '𝚁', '𝚂', '𝚃', '𝚄', '𝚅', '𝚆', '𝚇', '𝚈', '𝚉', '𝚊', '𝚋', '𝚌', '𝚍', '𝚎', '𝚏', '𝚐', '𝚑', '𝚒', '𝚓', '𝚔', '𝚕', '𝚖', '𝚗', '𝚘', '𝚙', '𝚚', '𝚛', '𝚜', '𝚝', '𝚞', '𝚟', '𝚠', '𝚡', '𝚢', '𝚣'),
  "bn": ('⓪', '➀', '➁', '➂', '➃', '➄', '➅', '➆', '➇', '➈', 'Ⓐ', 'Ⓑ', 'Ⓒ', 'Ⓓ', 'Ⓔ', 'Ⓕ', 'Ⓖ', 'Ⓗ', 'Ⓘ', 'Ⓙ', 'Ⓚ', 'Ⓛ', 'Ⓜ', 'Ⓝ', 'Ⓞ', 'Ⓟ', 'Ⓠ', 'Ⓡ', 'Ⓢ', 'Ⓣ', 'Ⓤ', 'Ⓥ', 'Ⓦ', 'Ⓧ', 'Ⓨ', 'Ⓩ', 'ⓐ', 'ⓑ', 'ⓒ', 'ⓓ', 'ⓔ', 'ⓕ', 'ⓖ', 'ⓗ', 'ⓘ', 'ⓙ', 'ⓚ', 'ⓛ', 'ⓜ', 'ⓝ', 'ⓞ', 'ⓟ', 'ⓠ', 'ⓡ', 'ⓢ', 'ⓣ', 'ⓤ', 'ⓥ', 'ⓦ', 'ⓧ', 'ⓨ', 'ⓩ'),
  #"bb": ('➊', '➋', '➌', '➍', '➎', '➏', '➐', '➑', '➒', '🅐', '🅑', '🅒', '🅓', '🅔', '🅕', '🅕', '🅖', '🅗','🅘', '🅙', '🅚', '🅛', '🅜', '🅝', '🅞', '🅟', '🅠', '🅡', '🅢', '🅣', '🅤', '🅥', '🅦', '🅧', '🅨', '🅩', '🅐', '🅑', '🅒', '🅓', '🅔', '🅕', '🅕', '🅖', '🅗', '🅘', '🅙', '🅚', '🅛', '🅜', '🅝', '🅞', '🅟', '🅠', '🅡', '🅢', '🅣', '🅤', '🅥', '🅦', '🅧', '🅨', '🅩'),
  "ln": ('０', '１', '２', '３', '４', '５', '６', '７', '８', '９', 'Ａ', 'Ｂ', 'Ｃ', 'Ｄ', 'Ｅ', 'Ｆ', 'Ｇ', 'Ｈ', 'Ｉ', 'Ｊ', 'Ｋ', 'Ｌ', 'Ｍ', 'Ｎ', 'Ｏ', 'Ｐ', 'Ｑ', 'Ｒ', 'Ｓ', 'Ｔ', 'Ｕ', 'Ｖ', 'Ｗ', 'Ｘ', 'Ｙ', 'Ｚ', 'ａ', 'ｂ', 'ｃ', 'ｄ', 'ｅ', 'ｆ', 'ｇ', 'ｈ', 'ｉ', 'ｊ', 'ｋ', 'ｌ', 'ｍ', 'ｎ', 'ｏ', 'ｐ', 'ｑ', 'ｒ', 'ｓ', 'ｔ', 'ｕ', 'ｖ', 'ｗ', 'ｘ', 'ｙ', 'ｚ'),
  #"an": ('0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'ᴀ', 'ʙ', 'ᴄ', 'ᴅ', 'ᴇ', 'ғ', 'ɢ', 'ʜ', 'ɪ', 'ᴊ', 'ᴋ', 'ʟ', 'ᴍ', 'ɴ', 'ᴏ', 'ᴘ', 'ǫ', 'ʀ', 's', 'ᴛ', 'ᴜ', 'ᴠ', 'ᴡ', 'x', 'ʏ', 'ᴢ', 'ᴀ', 'ʙ', 'ᴄ', 'ᴅ', 'ᴇ', 'ғ', 'ɢ', 'ʜ', 'ɪ', 'ᴊ', 'ᴋ', 'ʟ', 'ᴍ', 'ɴ', 'ᴏ', 'ᴘ', 'ǫ', 'ʀ', 's', 'ᴛ', 'ᴜ', 'ᴠ', 'ᴡ', 'x', 'ʏ', 'ᴢ'),
  "mn": ('⁰', '¹', '²', '³', '⁴', '⁵', '⁶', '⁷', '⁸', '⁹', 'ᴬ', 'ᴮ', 'ᶜ', 'ᴰ', 'ᴱ', 'ᶠ', 'ᴳ', 'ᴴ', 'ᴵ', 'ᴶ', 'ᴷ', 'ᴸ', 'ᴹ', 'ᴺ', 'ᴼ', 'ᴾ', 'ᵠ', 'ᴿ', 'ˢ', 'ᵀ', 'ᵁ', 'ᵛ', 'ᵂ', 'ᵡ', 'ᵞ', 'ᶻ', 'ᵃ', 'ᵇ', 'ᶜ', 'ᵈ', 'ᵉ', 'ᶠ', 'ᵍ', 'ʰ', 'ⁱ', 'ʲ', 'ᵏ', 'ˡ', 'ᵐ', 'ᶰ', 'ᵒ', 'ᵖ', 'ᵠ', 'ʳ', 'ˢ', 'ᵗ', 'ᵘ', 'ᵛ', 'ʷ', 'ˣ', 'ʸ', 'ᶻ'),
  "xt": ('0̶', '1̶', '2̶', '3̶', '4̶', '5̶', '6̶', '7̶', '8̶', '9̶', 'A̶', 'B̶', 'C̶', 'D̶',  'E̶', 'F̶', 'G̶', 'H̶', 'I̶', 'J̶', 'K̶', 'L̶', 'M̶', 'N̶', 'Ñ̶', 'O̶', 'P̶', 'Q̶', 'R̶', 'S̶', 'T̶', 'U̶', 'V̶', 'W̶', 'X̶', 'Y̶', 'Z̶', 'a̶', 'b̶', 'c̶', 'd̶',  'e̶', 'f̶', 'g̶', 'h̶', 'i̶', 'j̶', 'k̶', 'l̶', 'm̶', 'n̶', 'ñ̶', 'o̶', 'p̶', 'q̶', 'r̶', 's̶', 't̶', 'u̶', 'v̶', 'w̶', 'x̶', 'y̶', 'z̶'),
  "xk": ('0̷', '1̷', '2̷', '3̷', '4̷', '5̷', '6̷', '7̷', '8̷', '9̷', 'A̷', 'B̷', 'C̷', 'D̷',  'E̷', 'F̷', 'G̷', 'H̷', 'I̷', 'J̷', 'K̷', 'L̷', 'M̷', 'N̷', 'Ñ̷', 'O̷', 'P̷', 'Q̷', 'R̷', 'S̷', 'T̷', 'U̷', 'V̷', 'W̷', 'X̷', 'Y̷', 'Z̷', 'a̷', 'b̷', 'c̷', 'd̷', 'e̷', 'f̷', 'g̷', 'h̷', 'i̷', 'j̷', 'k̷', 'l̷', 'm̷', 'n̷', 'ñ̷', 'o̷', 'p̷', 'q̷', 'r̷', 's̷', 't̷', 'u̷', 'v̷', 'w̷', 'x̷', 'y̷', 'z̷' ),
  "ul": ('0̲', '1̲', '2̲', '3̲', '4̲', '5̲', '6̲', '7̲', '8̲', '9̲', 'A̲', 'B̲', 'C̲', 'D̲', 'E̲', 'F̲', 'G̲', 'H̲', 'I̲', 'J̲', 'K̲', 'L̲', 'M̲', 'N̲', 'Ñ̲', 'O̲', 'P̲', 'Q̲', 'R̲', 'S̲', 'T̲', 'U̲', 'V̲', 'W̲', 'X̲', 'Y̲', 'Z̲', 'a̲', 'b̲', 'c̲', 'd̲', 'e̲', 'f̲', 'g̲', 'h̲', 'i̲', 'j̲', 'k̲', 'l̲', 'm̲', 'n̲', 'ñ̲', 'o̲', 'p̲', 'q̲', 'r̲', 's̲', 't̲', 'u̲', 'v̲', 'w̲', 'x̲', 'y̲', 'z̲'),
  "ud": ('0͇', '1͇', '2͇', '3͇', '4͇', '5͇', '6͇', '7͇', '8͇', '9͇', 'A͇', 'B͇', 'C͇', 'D͇', 'E̳', 'F͇', 'G͇', 'H͇', 'I͇', 'J͇', 'K͇', 'L͇', 'M͇', 'N͇', 'Ñ͇', 'O͇', 'P͇', 'Q͇', 'R͇', 'S͇', 'T͇', 'U͇', 'V͇', 'W͇', 'X͇', 'Y͇', 'Z͇', 'a͇', 'b͇', 'c͇', 'd͇', 'e̳', 'f͇', 'g͇', 'h͇', 'i͇', 'j͇', 'k͇', 'l͇', 'm͇', 'n͇', 'ñ͇', 'o͇', 'p͇', 'q͇', 'r͇', 's͇', 't͇', 'u͇', 'v͇', 'w͇', 'x͇', 'y͇', 'z͇'),
  "up": ('0̤', '1̤', '2̤', '3̤', '4̤', '5̤', '6̤', '7̤', '8̤', '9̤', 'A̤', 'B̤', 'C̤', 'D̤', 'E̤', 'F̤', 'G̤', 'H̤', 'I̤', 'J̤', 'K̤', 'L̤', 'M̤', 'N̤', 'Ñ̤', 'O̤', 'P̤', 'Q̤', 'R̤', 'S̤', 'T̤', 'Ṳ', 'V̤', 'W̤', 'X̤', 'Y̤', 'Z̤', 'a̤', 'b̤', 'c̤', 'd̤', 'e̤', 'f̤', 'g̤', 'h̤', 'i̤', 'j̤', 'k̤', 'l̤', 'm̤', 'n̤', 'ñ̤', 'o̤', 'p̤', 'q̤', 'r̤', 's̤', 't̤', 'ṳ', 'v̤', 'w̤', 'x̤', 'y̤', 'z̤'),


}        



OPERATORS = {
  "BASIC_NUMS": (0, 1, 2, 3, 4, 5, 6, 7, 8, 9),
  "EXTRA_NUMS": ('π', 'pi', 'Π', 'e', 'φ', 'γ' ),
  "BRACK_O": ('(','[','{'),
  "BRACK_C": (')',']','}'),
  "POV": ('^'),
  "SQRT": ('√','∛','∜'),
  "MULT": ('*','×', '⨯', '⋅', 'por', 'times'),
  "DIV": ('/', '÷', 'by', 'entre'),
  "FRACT":('¼', '½', '¾', '⅓', '⅐', '⅑', '⅒', '⅔', '⅕', '⅖', '⅗', '⅘', '⅙', '⅚', '⅛', '⅜', '⅝', '⅞'),
  "PCENT": ('%','‰','‱'),
  "ADD": ('+', 'mas', 'plus'),
  "SUB": ('-', 'minus', 'menos'),
  "PUNTUATION": ('.', ',')
}    

  # "MOD": ('mod'),
  # "ANGL": ('º', 'grad', 'rad'),
  # "ADV":('!','|','\'','∫' )                    
  
  # CONSTANS DEFINED:
  # constant π                  3.14159265358979323846264338327950288419716939937510...
  # number e                    2.71828182845904523536028747135266249775724709369995...
  # golden ratio φ              1.61803398874989484820458683436563811772030917980576...
  # Euler–Mascheroni constant γ 0.57721566490153286060651209008240243104215933593992...
  # Apéry's constant ζ(3)       1.20205690315959428539973816151144999076498629234049...
  # Catalan's constant G        0.91596559417721901505460351493238411077414937428167...
  # Feigenbaum constant α       4.66920160910299067185320382046620161725818557747576... 
  # Feigenbaum constant δ       2.50290787509589282228390287321821578638127137672714...
  # Lemniscate constant ϖ       2.6220575542921198104648395898911941...
                                                     

# All styles:
#■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

# nn Default font, no style.
# fb Serif Bold.
# fi Serif Italic.
# fd Serif Italic Bold.
# tn Script Normal.
# tb Script Bold.
# gn Gothic Normal.
# gb Gothic Bold.
# hn Highlighted.
# sn Standar Sans.
# si Italic Sans.
# sb Bold Sans.
# sd Italic Bold Sans.
# wn TypeWriter.
# bn White Bubble. s
# bb Black Bubble.  #! *
# ln Fullwidth  Style.    
# an Futuristic.  #! *
# mn Small Super Index.

# xt Strikethrough.
# xk Streaked.
# ul UnderLine
# ud Double Underline.
# up Underpoints.


#! No lower case. REQUIRE DEFAULT LOWER CASE FONT.



# Others styles to apply in a future:
#■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

# 0123456789 ABCDEFGHIJKLMNÑOPQRSTUVWXYZ abcdefghijklmnñopqrstuvwxyz

# 0123456789 ABCDEFGHIJKLMNÑOPQRSTUVWXYZ ᴀʙᴄᴅᴇꜰɢʜɪᴊᴋʟᴍɴñᴏᴘqʀꜱᴛᴜᴠᴡxʏᴢ


# 0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣ ​🇦​​🇧​​🇨​​🇩​​🇪​​🇫​​🇬​​🇭​​🇮​​🇯​​🇰​​🇱​​🇲​​🇳​Ñ​🇴​​🇵​​🇶​​🇷​​🇸​​🇹​​🇺​​🇻​​🇼​​🇽​​🇾​​🇿​ ​🇦​​🇧​​🇨​​🇩​​🇪​​🇫​​🇬​​🇭​​🇮​​🇯​​🇰​​🇱​​🇲​​🇳​ñ​🇴​​🇵​​🇶​​🇷​​🇸​​🇹​​🇺​​🇻​​🇼​​🇽​​🇾​​🇿​

# Underline
#0̲1̲2̲3̲4̲5̲6̲7̲8̲9̲ ̲A̲B̲C̲D̲E̲F̲G̲H̲I̲J̲K̲L̲M̲N̲Ñ̲O̲P̲Q̲R̲S̲T̲U̲V̲W̲X̲Y̲Z̲ ̲a̲b̲c̲d̲e̲f̲g̲h̲i̲j̲k̲l̲m̲n̲ñ̲o̲p̲q̲r̲s̲t̲u̲v̲w̲x̲y̲z̲

# Double Underline
#(0͇1͇2͇3͇4͇5͇6͇7͇8͇9͇A͇B͇C͇D͇E̳F͇G͇H͇I͇J͇K͇L͇M͇N͇Ñ͇O͇P͇Q͇R͇S͇T͇U͇V͇W͇X͇Y͇Z͇a͇b͇c͇d͇e̳f͇g͇h͇i͇j͇k͇l͇m͇n͇ñ͇o͇p͇q͇r͇s͇t͇u͇v͇w͇x͇y͇z͇ )

# Between Lines
#͟͞ 0͟͞1͟͞2͟͞3͟͞4͟͞5͟͞6͟͞7͟͞8͟͞9͟͞ A͟͞B͟͞C͟͞D͟͞E͟͞F͟͞G͟͞H͟͞I͟͞J͟͞K͟͞L͟͞M͟͞N͟͞Ñ͟͞O͟͞P͟͞Q͟͞R͟͞S͟͞T͟͞U͟͞V͟͞W͟͞X͟͞Y͟͞Z͟͞ a͟͞b͟͞c͟͞d͟͞e͟͞f͟͞g͟͞h͟͞i͟͞j͟͞k͟͞l͟͞m͟͞n͟͞ñ͟͞o͟͞p͟͞q͟͞r͟͞s͟͞t͟͞u͟͞v͟͞w͟͞x͟͞y͟͞z͟͞

# Underpoints
#(̤0̤1̤2̤3̤4̤5̤6̤7̤8̤9̤A̤B̤C̤D̤E̤F̤G̤H̤I̤J̤K̤L̤M̤N̤Ñ̤O̤P̤Q̤R̤S̤T̤ṲV̤W̤X̤Y̤Z̤ ̤a̤b̤c̤d̤e̤f̤g̤h̤i̤j̤k̤l̤m̤n̤ñ̤o̤p̤q̤r̤s̤t̤ṳv̤w̤x̤y̤z̤ )

# 𝟶⃨𝟷⃨𝟸⃨𝟹⃨𝟺⃨𝟻⃨𝟼⃨𝟽⃨𝟾⃨𝟿⃨ 𝙰⃨𝙱⃨𝙲⃨𝙳⃨𝙴⃨𝙵⃨𝙶⃨𝙷⃨𝙸⃨𝙹⃨𝙺⃨𝙻⃨𝙼⃨𝙽⃨𝙽⃨𝙾⃨𝙿⃨𝚀⃨𝚁⃨𝚂⃨𝚃⃨𝚄⃨𝚅⃨𝚆⃨𝚇⃨𝚈⃨𝚉⃨  𝚊⃨𝚋⃨𝚌⃨𝚍⃨𝚎⃨𝚏⃨𝚐⃨𝚑⃨𝚒⃨𝚓⃨𝚔⃨𝚕⃨𝚖⃨𝚗⃨𝚗⃨𝚘⃨𝚙⃨𝚚⃨𝚛⃨𝚜⃨𝚝⃨𝚞⃨𝚟⃨𝚠⃨𝚡⃨𝚢⃨𝚣⃨

# double double
# 0͇̿1͇̿2͇̿3͇̿4͇̿5͇̿6͇̿7͇̿8͇̿9͇̿  A͇̿B͇̿C͇̿D͇̿E͇̿F͇̿G͇̿H͇̿I͇̿J͇̿K͇̿L͇̿M͇̿N͇̿Ñ͇̿O͇̿P͇̿Q͇̿R͇̿S͇̿T͇̿U͇̿V͇̿W͇̿X͇̿Y͇̿Z͇̿  a͇̿b͇̿c͇̿d͇̿e͇̿f͇̿g͇̿h͇̿i͇̿j͇̿k͇̿l͇̿m͇̿n͇̿ñ͇̿o͇̿p͇̿q͇̿r͇̿s͇̿t͇̿u͇̿v͇̿w͇̿x͇̿y͇̿z͇̿

# StrikeThrough
#(0̶1̶2̶3̶4̶5̶6̶7̶8̶9̶A̶B̶C̶D̶E̶F̶G̶H̶I̶J̶K̶L̶M̶N̶Ñ̶O̶P̶Q̶R̶S̶T̶U̶V̶W̶X̶Y̶Z̶a̶b̶c̶d̶e̶f̶g̶h̶i̶j̶k̶l̶m̶n̶ñ̶o̶p̶q̶r̶s̶t̶u̶v̶w̶x̶y̶z̶)

# Streaked
#(0̷1̷2̷3̷4̷5̷6̷7̷8̷9̷A̷B̷C̷D̷E̷F̷G̷H̷I̷J̷K̷L̷M̷N̷Ñ̷O̷P̷Q̷R̷S̷T̷U̷V̷W̷X̷Y̷Z̷ ̷a̷b̷c̷d̷e̷f̷g̷h̷i̷j̷k̷l̷m̷n̷ñ̷o̷p̷q̷r̷s̷t̷u̷v̷w̷x̷y̷z̷ )

# Reverse Full
 #0123456789 zʎxʍʌnʇsɹbdoñuɯןʞɾıɥƃɟǝpɔqɐ ZʎXMΛ∩⊥SᴚὉԀOÑNW˥ʞſIHƃℲƎᗡϽq∀ 
 
 # Reverse Mirror
 #0123456789 ∀qϽᗡƎℲƃHIſʞ˥WNÑOԀὉᴚS⊥∩ΛMXʎZ ɐqɔpǝɟƃɥıɾʞןɯuñodbɹsʇnʌʍxʎz  
 
 # Random
 # 012𝟛45𝟞𝟟8𝟡 𝑨𝔅𝘾𝔇𝙴𝔉𝗚𝕳ℑ𝘑𝙆𝐋𝓜𝕹𝓝̃𝑂𝒫𝓠𝓡𝔖𝗧𝗨𝖁𝘞𝐗𝚈𝚉 𝗮𝗯𝒸𝓭𝔢𝐟𝑔𝐡𝖎𝕛𝕜𝘭𝗺𝙣𝓷̃𝕠𝓅𝙦𝒓𝑠𝘁𝓊𝙫𝓌𝑥𝙮𝕫
 # 𝟘1𝟮34567𝟠9 𝓐𝘉ℭ𝐃𝓔𝕱𝙂𝙃𝕴𝕵𝙺𝗟𝓜𝒩𝑵̃𝑂𝔓ℚℜ𝓢𝒯𝘜𝖁𝒲𝓧𝚈𝑍 𝘢𝙗𝒸𝔡𝔢𝙛ℊ𝗵𝐢𝚓𝓀𝓵𝐦𝕟𝘯̃𝕠𝐩𝑞𝔯𝔰𝙩𝙪𝙫𝓌𝑥𝙮𝓏
 # 0𝟭𝟮3𝟰567𝟖9 𝐴𝗕𝘾𝗗𝙀𝗙𝘎𝗛𝗜𝘑𝙆𝐋𝑴𝗡𝑵̃𝐎𝑃𝑸𝑹𝗦𝘛𝘜𝗩𝘞𝐗𝙔𝙕 𝘢𝘣𝑐𝒅𝗲𝐟𝐠𝐡𝗶𝒋𝒌𝘭𝘮𝙣𝒏̃𝒐𝑝𝙦𝑟𝐬𝘵𝑢𝙫𝑤𝐱𝙮𝒛
 # 0123456789 ᎪᏴᏟᎠᎬᎱᏀᎻᏆᎫᏦᏞᎷᏁÑᎾᏢᎤᎡᏚᎢᏬᏙᎳᎲᎩᏃ ꭺᏼꮯꭰꭼꮁᏽꮋꮖꭻꮶꮮꮇꮑñꮎꮲꭴꭱꮪꭲꮼꮩꮤꮂꭹꮓ


# Whites cuts
# ⓪1②3④5⑥7⑧9 🄰Ⓑ🄲Ⓓ🄴Ⓕ🄶Ⓗ🄸Ⓙ🄺Ⓛ🄼ⓃÑⓄ🄿Ⓠ🅁Ⓢ🅃Ⓤ🅅Ⓦ🅇Ⓨ🅉 🄰ⓑ🄲ⓓ🄴ⓕ🄶ⓗ🄸ⓙ🄺ⓛ🄼ⓝñⓞ🄿ⓠ🅁ⓢ🅃ⓤ🅅ⓦ🅇ⓨ🅉

# Square
# '0', '1', '2' ,'3', '4', '5', '6', '7', '8', '9', '🅰', '🅱', '🅲', '🅳', '🅴', '🅵', '🅶', '🅷', '🅸', '🅹', '🅺', '🅻', '🅼', '🅽', '🅾', '🅿', '🆀', '🆁', '🆂', '🆃', '🆄', '🆅', '🆆', '🆇', '🆈', '🆉', '🅰', '🅱', '🅲', '🅳', '🅴', '🅵', '🅶', '🅷', '🅸', '🅹', '🅺', '🅻', '🅼', '🅽', '🅾', '🅿', '🆀', '🆁', '🆂', '🆃', '🆄', '🆅', '🆆', '🆇', '🆈', '🆉'

# Style Vai
# 0123456789 ꗇꕗꖀꕒꗍꘘꗱꖾꕯʆꗣꝆꕮꖦÑꗞꘝꕪ𐝥ꕷꖡꖹꘜⱲꘉꔇꕩ ꗇꕗꖀꕒꗍꘘꗱꖾꕯʆꗣꝆꕮꖦñꗞꘝꕪ𐝥ꕷꖡꖹꘜⱲꘉꔇꕩ

# Style Bamum
# 0123456789 𖧥𖧳𖥐𖦧𖠢𖨨ꛪ𖦙𖥣𖨗𖢉ꛚ𖢑ꛘÑ𖥕𖡮𖥨𖦪𖨚𖢧ꚶ𖡥𖧉𖧦ꚲ𖣩 𖧥𖧳𖥐𖦧𖠢𖨨ꛪ𖦙𖥣𖨗𖢉ꛚ𖢑ꛘñ𖥕𖡮𖥨𖦪𖨚𖢧ꚶ𖡥𖧉𖧦ꚲ𖣩

#Mini capitals
# ᴀʙᴄᴅᴇꜰɢʜɪᴊᴋʟᴍɴɴ̃ᴏᴘǫʀsᴛᴜᴠᴡxʏᴢ

# Roman Numbers
# ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅪⅫⅬⅭⅮⅯ ⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹⅺⅻⅼⅽⅾⅿ



#     ● • ● • ● • ● • ● • ● • ● • ● • ● • ● • ● • ● • ● 
# 		              	  · • 𝗮𝘀𝗳 • ·		

#     🙼🙼🙼 🙼🙼🙼 🙼🙼🙼       🙽🙽🙽 🙽🙽🙽 🙽🙽🙽
#                    <⫷ dasd ⫸>
#     🙽🙽🙽 🙽🙽🙽 🙽🙽🙽       🙼🙼🙼 🙼🙼🙼 🙼🙼🙼

#                <⫷ dasd ⫸>

#               ▁▂▃▅▆▇  MAX  ▇▆▅▃▂▁


# ▘ ▝▗ ▀ ▄ ▚ ▛ ▟ █ Frag  █ ▙ ▜ ▞ ▄ ▀ ▖▘ ▝

#⛆⛆⛆⛆⛆⛆⛆⛆⛆⛆⛆⛆

#⛓⛓⛚⛝⚽⛯⛭⛫⛘⛶⛤⛼⛾⛿⛒⛏⛅⛈

#꧁༺ 𝓕𝓪𝓷𝓬𝔂 𝓽𝓮𝔁𝓽 𝓰𝓮𝓷𝓮𝓻𝓪𝓽𝓸𝓻 ༻꧂

#░5░t░u░t░e
#🙼🙼🙼 🙼🙼🙼 🙼🙼🙼 🙼🙼🙼 
#🙽🙽🙽 🙽🙽🙽 🙽🙽🙽 🙽🙽🙽 
#🙼🙼🙼 🙼🙼🙼 🙼🙼🙼 🙼🙼🙼
#🙽🙽🙽 🙽🙽🙽 🙽🙽🙽 🙽🙽🙽 

# 【X】 『5』  [̲̅1]



# ASCII_STYLES = {
#   "NORMAL":("@QB#NgWM8RDHdOKq9$6khEPXwmeZaoS2yjufF]}{tx1zv7lciL/\\|?*>r^;:_\"~,'.-`";)
# }

  # 0-255
# >>>gscale1 = "¶$@B%8&WM#*oahkbdpqwmZO0QLCJUYXzcvunxrjft/\|()1{}[]?-_+~i!lI;:,\"^".` "    #70 levels of gray
# >>>gscale2 = "@%#*+=-:. "         #10 levels of gray


# ASCII 	
# 0-255
# ¶@ØÆMåBNÊßÔR#8Q&mÃ0À$GXZA5ñk2S%±3Fz¢yÝCJf1t7ªLc¿+?(r/¤²!*;"^:,'.`
 
# Runic 	
# 0x16A0-0x16FF
# ᛥᛤᛞᚥᚸᛰᛖᚻᚣᛄᚤᛒᚢᚱᛱᚷᚫᛪᚧᚬᚠᛏᚨᚰᚩᚮᚪᚳᚽᚿᛊᛁᛵᛍ᛬ᚲᛌ᛫

# Box Drawing 	
# 0x2500-0x257F
# ╬ ╠ ╫ ╋ ║ ╉ ╩ ┣ ╦ ╂ ╳ ╇ ╈ ┠ ╚ ┃╃ ┻ ╅ ┳┡┢ ┹╀ ╧ ┱╙┗┞┇┸┋┯┰┖╲╱┎╘━┭┕┍┅╾│┬┉╰╭╸└┆╺┊─╌┄┈╴╶

# Block Elements 	
# 0x2580-0x259F
# █▉▇▓▊▆▅▌▚▞▀▒▐▍▖▃▂░▁▏

# Geometric Shapes 	
# 0x25A0-0x25FF
# ◙◘■▩●▦▣◚◛◕▨▧◉▤◐◒▮◍◑▼▪◤▬◗◭◖◈◎◮◊◫▰◄◯□▯▷▫▽◹△◁▸▭◅▵◌▱▹▿◠◃◦◟◞◜


# ■▩▦▨▧▥▤▣◧◩◫◰◱⬚▢◻▪▫
# ⬤◍◕◉◐◒◔◎⭙◴◯⭘●○◌◦
# ⭐🙩🙫🙪🙨✺✱❂✹✸✷✮✴✫✬✭✵✩✲✯✳✰✶⭑⭒ 
# ✿❁✽✾❃✻✼❀
# ⬛⬜◾◽
#
# ␥⑊⑇⑈⑉
# ⣿⣾⣻⣼⣺⣣⣱⣬⣌⣢⣈⣠⢐⣀⢀⠀  x16

# 🁢🂓🂒🂅🂄🁽🂃🁼🁶🁮🁴🁬🁦🁫🁤🁣 x16
# 𝌆𝌡𝌢𝌣𝌥𝌨𝌧𝍎𝌾𝌩𝍑𝌲𝌸𝍔𝍕𝍓𝍖𝌁𝌄𝌅𝌀  x21

# █ ▙ ▛ ▜ ▟ ▞ ▚ ▀ ▄ ▖ ▗ ▘ ▝   → TO QR Image.

#🙭🙬
# █ ▓ ▒ ░ 
# █ ▉ ▊ ▋ ▍ ▌ ▎▏▏|
#  ▉▇▆▅▃▂▁
 #
 
 #  〪〭〫〬  //balls in each corner
 # ⿰ ⿱ ⿲ ⿳ ⿴ ⿵ ⿶ ⿷ ⿷ ⿹ ⿺ ⿻
 
 
# A˹˺B˹˺C˹˺

 
 
        #🙼🙼🙼🙼🙽🙽🙽🙽🙽
        #⫷⫷⫷⫸⫸⫸⫸   ⫻⫻⫻⫼⫼⫽⫿⫾   … ⋮ ⫶ ⋯ ⋰ ⋱ ⁒ ⁚⁞ ⩸⩧⩷  ⩩ ⩨ ⸎※
        # 
        #   ▛▜
        #   ▙▟
        
         
            # SUM/REST  =   +, - 
        # MULT      =    *    ×    ⨯  ⋅
        # DIV       =    /    ÷     %       MOD  ⁒
        # POV       =   ^       
        # Root      =   √a  3√ √  ∛  ∜
        # Equal     =   =   
        # Percent   =   70% x 5 = 3.…       ‰ (permille)  ‱ ppm(per million)
        # 
        # ∞  ≠ ≤  ≥  ⨱   ⨰  ⩱  ⩲  ⩵  ⩶   < >  «  »  ¬
        #   
        # Angu. =       º, grad,  rad,
        # Brackets:        (  )  [ ]  { }
        # Round         ⌊x⌋ Lower        ⌈x⌉    Upper
        #  
        #  ¼  ½  ¾ ⅓ ⅐ ⅑ ⅒ ⅔ ⅕ ⅖ ⅗ ⅘ ⅙ ⅚ ⅛ ⅜ ⅝ ⅞
        # 
        # Others    4!  → Factorial = 1*2*3*4 = 24
        #           |-6|  → Absolute value = 4
        #           (…)' → derivavte
        #           ∫   → Integral
        # 
        # 
        #   # CONSTANTS = 
        # 
        #       π  pi   3.141592654
        #       e       2.718281828
        #       γ       0.5772156649
        # 
        # 
        #  ≡ ≡ ≣  ≟  ≞  ≝  ∷  ∶ ∺
        # 
        #  ⁱ⁰¹²³⁴⁵⁶⁷⁸⁹ ⁺ ⁻  ⁼ ⁽⁾ⁿ
        # 	      ₀₁₂₃₄₅₆₇₈₉₊₋₌₍₎
        # ﹛﹜﹙﹚﹘﹖﹗ ﹕ ﹔ ﹟ ﹠﹡ ﹢ ﹣ ﹤ ﹥﹦﹨﹩﹪﹫
        #        z = 3 + 2i
        # 
        #           IVXLCDM   Ⅰ Ⅱ Ⅲ Ⅳ Ⅴ Ⅵ Ⅶ Ⅷ Ⅸ Ⅹ Ⅺ Ⅻ Ⅼ Ⅽ Ⅾ Ⅿ
        # 
        # #
        #
        
        
        
		# ▉▀▀▀▀▉
		# █ ▛▜ █
    # █ ▙▟ █
		# ▉▄▄▄▄▉





		# ❐▀▀▀▀❐
		# █ ▛▜ █
    # █ ▙▟ █
		# ❐▄▄▄▄❐



		# ▛▬▬▬▬▜
		# ▮ ▛▜ ▮
    # ▮ ▙▟ ▮
		# ▙▬▬▬▬▟



		# ⬛▀▀▀▀⬛
		# █ ▛▜ █
    # █ ▙▟ █
		# ⬛▄▄▄▄⬛


		# █▀▀▀▀▀▀█
		# █ █▀▀█ █
    # █ █▄▄█ █
		# █▄▄▄▄▄▄█
